Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/faq.tmx
Source language: en
Languages: fr

source: For more complicated input parsing, regular expressions more powerful than C's :cfunc:`sscanf` and better suited for the task.
fr: Pour les analyses plus compliquées, les expressions rationnelles sont plus puissantes que la fonction `sscanf` de C et mieux adaptées à la tâche.

source: What does 'UnicodeDecodeError' or 'UnicodeEncodeError' error mean?
fr: Que signifient les erreurs 'UnicodeDecodeError' ou 'UnicodeEncodeError'?

source: How do I convert between tuples and lists?
fr: Comment convertir les listes en tuples et inversement?

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
fr: Le constructeur de type ``tuple(seq)`` convertit toute séquence (en fait tout itérable) en un tuple avec les mêmes éléments dans le même ordre…

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
fr: Par exemple ``tuple([1, 2, 3])`` renvoi ``(1, 2, 3)`` et ``tuple('abc')`` renvoi ``('a', 'b', 'c')``. Si l'argument est un tuple, cela ne crèe pas une copie, mais renvoi le même objet, ce qui en fait un fonction économique à appeler quand vous ne savez pas si votre objet est déjà un tulpe.

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
fr: Le constructeur de type ``list(seq)`` convertit toute séquence ou itérable en liste contenant les mêmes éléments dans le même ordre. Par exemple, ``list((1,2,3))`` retourne ``[1,2,3]`` et ``list('abc')`` retourne ``['a','b','c']``. Si l'argument est une liste, il retourne une copie, de la même façon que ``seq[:]``.

source: What's a negative index?
fr: Qu'est-ce qu'un indexe négatif?

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
fr: Les séquences Python sont indexées avec des nombres positifs aussi bien que négatifs. Pour les nombres positifs, 0 est le premier index, 1 est le second, et ainsi de suite. Pour les indexes négatifs, -1 est le dernier index, -2 est le pénultième (avant dernier), et ainsi de suite. On peut aussi dire que ``seq[-n]`` est équivalent à ``seq[len(seq)-n]``.

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
fr: Utiliser des indexes négatifs peut être très pratique. Par exemple ``S[:-1]`` indique la chaine entière a l'exception du dernier caractère, ce qui est pratique pour retirer un caractère de fin de ligne en fin d'une chaine.

source: How do I iterate over a sequence in reverse order?
fr: Comment itérer à rebours sur une séquence?

source: Use the :func:`reversed` built-in function, which is new in Python 2.4::
fr: Utilisez la fonction embarquée :func:`reversed`, qui est apparue en Python 2.4::

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
fr: Cela ne modifiera pas votre séquence initiale, mais construira à la place une copie en ordre inverse pour itérer dessus.

source: With Python 2.3, you can use an extended slice syntax::
fr: Avec Python 2.3 vous pouvez utiliser la syntaxe étendue de tranches::

source: How do you remove duplicates from a list?
fr: Comment retirer les doublons d'une liste?

source: See the Python Cookbook for a long discussion of many ways to do this:
fr: Lisez le Python Cookbook pour trouver une longue discussion sur les nombreuses façons de faire cela:

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
fr: Si changer l'ordre de la liste ne vous dérange pas, commencez par trier celle ci, puis parcourez la d'un bout à l'autre, en supprimant les doublons trouvés en chemin::

source: If all elements of the list may be used as dictionary keys (i.e. they are all hashable) this is often faster ::
fr: Si tous les éléments de la liste peuvent être utilisés comme des clés de dictionnaire (cad, elles sont toutes hashables) ceci est souvent plus rapide::

source: In Python 2.5 and later, the following is possible instead::
fr: En Python 2.5 et suivant, la forme suivante est possible à la place::

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
fr: Ceci convertis la liste en un ensemble, ce qui supprime automatiquement les doublons, puis la transforme à nouveau en liste.

source: How do you make an array in Python?
fr: Comment construire un tableau en Python?

source: Use a list::
fr: Utilisez une liste::

source: ["this", 1, "is", "an", "array"]
fr: ["ceci", 1, "est", "un", "tableau"]

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
fr: Les listes ont un cout équivalent à celui des tableau C ou Pascal; la principale différence est qu'une liste Python peut contenir des objets de différents types.

source: The ``array`` module also provides methods for creating arrays of fixed types with compact representations, but they are slower to index than lists. Also note that the Numeric extensions and others define array-like structures with various characteristics as well.
fr: Le module ``array`` fournit des méthodes pour créer des tableaux de types fixes dans une représentation compacte, mais ils sont plus lents à indexer que les listes. Notez aussi que l'extension ``Numeric`` et d'autres, fournissent différentes structures de types tableaux, avec des caractéristiques différentes.

source: To get Lisp-style linked lists, you can emulate cons cells using tuples::
fr: Pour obtenir des listes chainées de type Lisp, vous pouvez émuler les "cons cells" en utilisant des tuples::

source: If mutability is desired, you could use lists instead of tuples. Here the analogue of lisp car is ``lisp_list[0]`` and the analogue of cdr is ``lisp_list[1]``. Only do this if you're sure you really need to, because it's usually a lot slower than using Python lists.
fr: Si vous voulez pouvoir modifier les éléments, utilisez une liste plutôt qu'un tuple. Ici la version équivalente au "car" de Lisp est ``lisp_list[0]`` et l'équivalent à "cdr" est ``list_lip[1]``. Ne faîtes ceci que si vous êtes réellement sûr d'en avoir besoin, cette méthode est en générale bien plus lente que les listes Python.

source: How do I create a multidimensional list?
fr: Comment puis-je créer une liste à plusieurs dimensions?

source: You probably tried to make a multidimensional array like this::
fr: Vous avez probablement essayé de créer une liste à plusieurs dimensions de cette façon::

source: This looks correct if you print it::
fr: Cela semble correct quand vous essayer de l'afficher::

source: But when you assign a value, it shows up in multiple places:
fr: Mais quand vous assignez une valeur, elle apparait en de multiples endroits::

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
fr: La raison en est que dupliquer une liste en utilisant ``*`` ne crée pas de copies, cela crée seulement des références aux objets existants. Le ``*3`` crée une liste contenant trois références à la même liste de longueur deux. Un changement dans une colonne apparaîtra donc dans toutes les colonnes. Ce qui n'est de façon quasi certaine, pas ce que vous souhaitez.

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
fr: L'approche suggérée est de créer une liste de la longueur désiré d'abords, puis de remplir tous les éléments avec une chaîne nouvellement créée.

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
fr: Cette liste générée contient trois listes différentes de longueur deux. Vous pouvez aussi utilisez la notation de compréhension de listes.

source: Or, you can use an extension that provides a matrix datatype; `Numeric Python <http://numpy.scipy.org/>`_ is the best known.
fr: Ou, vous pouvez utiliser une extension qui fournis un type de donnée de type matrice; `Numeric Python <http://numpy.scipy.org/>`_ étant le plus connu.

source: How do I apply a method to a sequence of objects?
fr: Comment appliquer une méthode à une séquence d'objets?

source: Use a list comprehension::
fr: Utilisez une compréhension de liste::

source: Dictionaries
fr: Dictionnaires

source: How can I get a dictionary to display its keys in a consistent order?
fr: Comment puis-je faire afficher les éléments d'un dictionnaire dans un ordre consistant?

source: You can't. Dictionaries store their keys in an unpredictable order, so the display order of a dictionary's elements will be similarly unpredictable.
fr: Vous ne pouvez pas. Les dictionnaires enregistrent leurs clées dans un ordre non prévisible, l'ordre d'affichage des éléments d'un dictionnaire sera donc de la même façon imprévisible.

source: This can be frustrating if you want to save a printable version to a file, make some changes and then compare it with some other printed dictionary. In this case, use the ``pprint`` module to pretty-print the dictionary; the items will be presented in order sorted by the key.
fr: Cela peut être frustrant si vous voulez sauvegarder une version affichable dans un fichier, faire des changement puis comparer avec un autre dictionnaire affiché. Dans ce cas, utilisez le module ``pprint``` pour afficher joliement le dictionnaire; les éléments seront présentés triés par clés.

source: A more complicated solution is to subclass ``dict`` to create a ``SortedDict`` class that prints itself in a predictable order. Here's one simpleminded implementation of such a class::
fr: Une solution plus compliquée est de sousclasser ``dict`` pour créer une classe``SorterDict`` qui s'affiche de façon prévisible. Voici une implémentation simple d'une telle classe::

source: This will work for many common situations you might encounter, though it's far from a perfect solution. The largest flaw is that if some values in the dictionary are also dictionaries, their values won't be presented in any particular order.
fr: Cela marchera dans la plupart des situations que vous pourriez rencontrer, même si c'est loin d'être une solution parfaite. Le plus gros problème avec cette solution est que si certaines valeurs dans le dictionnaire sont aussi des dictionnaire, alors elles ne seront pas présentées dans un ordre particulier.

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
fr: Je souhaite faire un tri compliqué: peut on faire une transformation de Schwartz en Python?

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, just use the ``key`` argument for the ``sort()`` method::
fr: Cette technique, attribuée à Randal Schwartz de la communauté Perl, trie les éléments d'une liste selon une mesure qui fait correspondre chaque élément à une "valeur de tri". En Python, utilisez simplement l'argument ``key`` de la méthode ``sort``::

source: The ``key`` argument is new in Python 2.4, for older versions this kind of sorting is quite simple to do with list comprehensions. To sort a list of strings by their uppercase values::
fr: L'argument ``key`` est apparus en Python 2.4, pour les anciennes versions de Python, ce type de tri est relativement simple à faire avec des compréhensions de liste. Pour trier une liste de chaines par leur valeur en majuscule on peut faire::

source: To sort by the integer value of a subfield extending from positions 10-15 in each string::
fr: Pour trier par la valeur d'un sous-champ allant des index 10 à 15 dans chaque chaine chaine::

source: For versions prior to 3.0, Isorted may also be computed by ::
fr: Pour les versions antérieures à 3.0, Isorted peut également être calculé par:

source: but since this method calls ``intfield()`` many times for each element of L, it is slower than the Schwartzian Transform.
fr: mais du fait que cette méthode appelle `` intfield () `` plusieurs fois pour chaque élément de L, elle est plus lente que la transformée de Schwartz.

source: How can I sort one list by values from another list?
fr: Comment puis-je trier une liste en fonction des valeurs d'une autre liste?

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
fr: Fusionnez les dans un itérateur de tuples, trier la liste obtenue, puis choisissez l'élément que vous voulez. ::

source: If you find this more legible, you might prefer to use this instead of the final list comprehension. However, it is almost twice as slow for long lists. Why? First, the ``append()`` operation has to reallocate memory, and while it uses some tricks to avoid doing that each time, it still has to do it occasionally, and that costs quite a bit. Second, the expression "result.append" requires an extra attribute lookup, and third, there's a speed reduction from having to make all those function calls.
fr: Si vous trouvez cela plus lisible, vous préférez peut-être utiliser ceci à la place de la compréhension de la liste finale. Toutefois, ceci est presque deux fois plus lent pour les longues listes. Pourquoi? Tout d'abord, ``append ()`` doit réaffecter la mémoire, et si il utilise quelques astuces pour éviter de le faire à chaque fois, il doit encore le faire de temps en temps, ce qui coûte assez cher. Deuxièmement, l'expression "result.append" exige une recherche d'attribut supplémentaire, et enfin, tous ces appels de fonction impactent la vitesse d'exécution.

source: Objects
fr: Objets

source: What is a class?
fr: Qu'est-ce qu'une classe?

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
fr: Une classe est le type d'objet particulier créé par l'exécution d'une déclaration de classe. Les objets de classe sont utilisés comme modèles pour créer des objets, qui incarnent à la fois les données (attributs) et le code (méthodes) spécifiques à un type de données.

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
fr: Une classe peut être fondée sur une ou plusieurs autres classes, appelée sa ou ses classes de base. Il hérite alors les attributs et les méthodes de ses classes de base. Cela permet à un modèle d'objet d'être successivement raffinés par héritage. Vous pourriez avoir une classe générique ``Mailbox`` qui fournit des méthodes d'accès de base pour une boîte aux lettres, et sous-classes telles que ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` qui gèrent les différents formats de boîtes aux lettres spécifiques.

source: What is a method?
fr: Qu'est-ce qu'une méthode?

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
fr: Une méthode est une fonction sur un objet ``x`` appelez normalement comme ``x.name(arguments…)``. Les méthodes sont définies comme des fonctions à l'intérieur de la définition de classe::

source: What is self?
fr: Qu'est-ce que self?

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
fr: Self est simplement un nom conventionnel pour le premier argument d'une méthode. Une méthode définie comme ``meth(self, a, b, c)`` doit être appelée en tant que ``x.meth(a, b, c)``, pour une instance ``x`` de la classe dans laquelle elle est définie, la méthode appelée considérera qu'elle est appelée ``meth(x, a, b, c)``.

source: See also :ref:`why-self`.
fr: Voir aussi: ref:`why-self`.

source: How do I check if an object is an instance of a given class or of a subclass of it?
fr: Comment puis-je vérifier si un objet est une instance d'une classe donnée ou d'une sous-classe de celui-ci?

source: Use the built-in function ``isinstance(obj, cls)``. You can check if an object is an instance of any of a number of classes by providing a tuple instead of a single class, e.g. ``isinstance(obj, (class1, class2, ...))``, and can also check whether an object is one of Python's built-in types, e.g. ``isinstance(obj, str)`` or ``isinstance(obj, (int, float, complex))``.
fr: Utilisez la fonction intégrée ``isInstance(obj, CLS)``. Vous pouvez vérifier si un objet est une instance de n'importe lequel d'un certain nombre de classes en fournissant un tuple à la place d'une seule classe, par exemple, ``IsInstance (obj, (Classe1, classe2, ...))``, et peut également vérifier si un objet est l'un des types intégrés à Python, par exemple, ``IsInstance (obj, str) isInstance`` ou ``(obj, (int, float, complexes ))``.

source: Note that most programs do not use :func:`isinstance` on user-defined classes very often. If you are developing the classes yourself, a more proper object-oriented style is to define methods on the classes that encapsulate a particular behaviour, instead of checking the object's class and doing a different thing based on what class it is. For example, if you have a function that does something::
fr: Notez que la plupart des programmes n'utilisent pas : func:``isInstance`` sur les classes définies par l'utilisateur, très souvent. Si vous développez vous-même les classes, un style plus appropriée orientée objet est de définir des méthodes sur les classes qui encapsulent un comportement particulier, au lieu de vérifier la classe de l'objet et de faire quelque chose de différent en fonction de sa classe. Par exemple, si vous avez une fonction qui fait quelque chose::

source: A better approach is to define a ``search()`` method on all the classes and just call it::
fr: Une meilleure approche est de définir une méthode ``search()`` sur toutes les classes et qu'il suffit d'appeler::

source: What is delegation?
fr: Qu'est-ce que la délégation?

source: Delegation is an object oriented technique (also called a design pattern). Let's say you have an object ``x`` and want to change the behaviour of just one of its methods. You can create a new class that provides a new implementation of the method you're interested in changing and delegates all other methods to the corresponding method of ``x``.
fr: La délégation est une technique orientée objet (aussi appelé un modèle de conception). Disons que vous avez un objet ``x`` et que vous souhaitez modifier le comportement d'une seule de ses méthodes. Vous pouvez créer une nouvelle classe qui fournit une nouvelle implémentation de la méthode qui vous intéresse dans l'évolution et les délégués de toutes les autres méthodes la méthode correspondante de ``x``.

source: Python programmers can easily implement delegation. For example, the following class implements a class that behaves like a file but converts all written data to uppercase::
fr: Les programmeurs Python peuvent facilement mettre en œuvre la délégation. Par exemple, la classe suivante implémente une classe qui se comporte comme un fichier, mais convertit toutes les données écrites en majuscules:

source: Here the ``UpperOut`` class redefines the ``write()`` method to convert the argument string to uppercase before calling the underlying ``self.__outfile.write()`` method. All other methods are delegated to the underlying ``self.__outfile`` object. The delegation is accomplished via the ``__getattr__`` method; consult :ref:`the language reference <attribute-access>` for more information about controlling attribute access.
fr: Ici, la classe ``UpperOut`` redéfinit la méthode ``write()`` pour convertir la chaîne d'argument en majuscules avant d'appeler la méthode sous-jacentes ``self.__outfile.write()``. Toutes les autres méthodes sont déléguées à l'objet sous-jacent ``self.__outfile``. La délégation se fait par la méthode ``__getattr__``, consulter: ref:`the language reference <attribute-access>` pour plus d'informations sur le contrôle d'accès d'attribut.

source: Note that for more general cases delegation can get trickier. When attributes must be set as well as retrieved, the class must define a :meth:`__setattr__` method too, and it must do so carefully. The basic implementation of :meth:`__setattr__` is roughly equivalent to the following::
fr: Notez que pour une utilisation plus générale de la délégation, les choses peuvent se compliquer. Lorsque les attributs doivent être définis aussi bien que récupérés, la classe doit définir une méthode :meth:``__setattr__`` aussi, et il doit le faire avec soin. La mise en œuvre basique de la méthode :meth:``__setattr__`` est à peu près équivalent à ce qui suit:

source: Most :meth:`__setattr__` implementations must modify ``self.__dict__`` to store local state for self without causing an infinite recursion.
fr: La plupart des implémentations de: meth:`__setattr__` doivent modifier ``self.__dict__`` pour stocker l'état locale de self sans provoquer une récursion infinie.

source: How do I call a method defined in a base class from a derived class that overrides it?
fr: Comment appeler une méthode définie dans une classe de base depuis une classe dérivée qui la surcharge?

source: Use the built-in :func:`super` function::
fr: Utilisez la fonction built-in :func:``super``::

source: For version prior to 3.0, you may be using classic classes: For a class definition such as ``class Derived(Base): ...`` you can call method ``meth()`` defined in ``Base`` (or one of ``Base``'s base classes) as ``Base.meth(self, arguments...)``. Here, ``Base.meth`` is an unbound method, so you need to provide the ``self`` argument.
fr: Pour version antérieure à 3.0, vous pouvez utiliser des classes classiques: Pour une définition de classe telle que ``class derived(Base)...`` vous pouvez appeler la méthode ``meth()`` défini dans `` `` Base (ou l'une des classes de base de ``Base``) en faisant ``Base.meth(self, arguments...)``. Ici, ``Base.meth`` est une méthode non liée, vous devez donc fournir l'argument ``self``.

source: How can I organize my code to make it easier to change the base class?
fr: Comment puis-je organiser mon code pour permettre de changer la classe de base plus facilement?
